AbanoubSalah/modbus-vault/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32-s3"

# --- Flash Config ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# --- SPI RAM ---
CONFIG_ESP32S3_SPIRAM_SUPPORT=y

# --- Partition Table ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partition_table/partitionTable.csv"
CONFIG_PARTITION_TABLE_FILENAME="partition_table/partitionTable.csv"

# --- Unit Tests ---
CONFIG_UNITY_ENABLE_64BIT=y
CONFIG_UNITY_ENABLE_COLOR=y
